package flaskrtest

public class Songs {

	private static final List<Map<String, String>> songs = [
		[
			'title': "時代",
			'by': "中島みゆき",
			'lyric': '''今はこんなに悲しくて　涙が枯れ果てて
もう二度と笑顔にはなれそうもないけれど

そんな時代もあったねと
いつか話せる日がくるわ
あんな時代もあったねと
きっと笑って話せるわ
だから今日はくよくよしないで
今日の風に吹かれましょう

まわるまわるよ時代は回る
喜び悲しみくり返し
今日は別れた恋人たちも
生まれ変わって巡り逢うよ

旅を続ける人々は
いつか故郷に出逢う日を
たとえ今夜は倒れても
きっと信じてドアを出る
たとえ今日は果てしもなく
冷たい雨が降っていても

めぐるめぐるよ時代は巡る
別れと出逢いをくり返し
今日は倒れた旅人たちも
生まれ変わって歩きだすよ

まわるまわるよ時代は回る
別れと出逢いをくり返し
今日は倒れた旅人たちも
生まれ変わって歩きだすよ

今日は倒れた旅人たちも
生まれ変わって歩きだすよ''',
		],
	]

	static Map<String, String> song(int index) {
		return this.songs.get(index)
	}
}
